app/controllers/api/v1/todos_controller.rb

  def index
    todos = Todo.all
    limit = params[:limit]

    if limit.present?
      limit = limit.to_i
      todos = todos.last(limit)
---
SELECT "todos".* FROM "todos"
SELECT "todos".* FROM "todos" ORDER BY "todos"."id" DESC LIMIT ?  [["LIMIT", 5]]

  def create
    todo = Todo.new(todo_params)

    if todo.save
---
INSERT INTO "todos" ("title", "completed", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "kkkkk"], ["completed", 0], ["created_at", "2024-02-15 16:29:48.099023"], ["updated_at", "2024-02-15 16:29:48.099023"]]

  def update
    if @todo.update(todo_params)
---
UPDATE "todos" SET "completed" = ?, "updated_at" = ? WHERE "todos"."id" = ?  [["completed", 1], ["updated_at", "2024-02-15 15:51:37.587795"], ["id", 29]]